In [1]:
"""44:00 / 1:05:23"""
import pandas as pd

df = pd.read_csv("friends.csv")
df

      name        city  marks
0    Harry      Rampur     92
1    Rohan     Kolkata     34
2   Skillf    Bareilly     24
3    Shubh  Antarctica     17
4    Aamit     Kolkata     15
5    Ahmed       Delhi     14
6  Raheman      Mumbai     34

In [2]:
id(df) #to check file location

2437043491024

In [3]:
new_df = df #this is only view of df
id(new_df)

2437043491024

In [4]:
new_df2 = df.copy() #this is a new copy of df
id(new_df2)

2437027525456

In [5]:
df

      name        city  marks
0    Harry      Rampur     92
1    Rohan     Kolkata     34
2   Skillf    Bareilly     24
3    Shubh  Antarctica     17
4    Aamit     Kolkata     15
5    Ahmed       Delhi     14
6  Raheman      Mumbai     34

In [6]:
new_df.loc[0, "name"] = "Abdul" #to update data
df

      name        city  marks
0    Abdul      Rampur     92
1    Rohan     Kolkata     34
2   Skillf    Bareilly     24
3    Shubh  Antarctica     17
4    Aamit     Kolkata     15
5    Ahmed       Delhi     14
6  Raheman      Mumbai     34

In [7]:
df.columns = ["A", "B", "C"] #to change columns name
df

         A           B   C
0    Abdul      Rampur  92
1    Rohan     Kolkata  34
2   Skillf    Bareilly  24
3    Shubh  Antarctica  17
4    Aamit     Kolkata  15
5    Ahmed       Delhi  14
6  Raheman      Mumbai  34

In [8]:
new_df = df.drop(0, axis=0)
new_df

         A           B   C
1    Rohan     Kolkata  34
2   Skillf    Bareilly  24
3    Shubh  Antarctica  17
4    Aamit     Kolkata  15
5    Ahmed       Delhi  14
6  Raheman      Mumbai  34

In [9]:
df.loc[[1,4], ["B", "C"]] #it's only return the value not change

         B   C
1  Kolkata  34
4  Kolkata  15

In [10]:
df.loc[:, ["B", "C"]] #to retreive all columns

            B   C
0      Rampur  92
1     Kolkata  34
2    Bareilly  24
3  Antarctica  17
4     Kolkata  15
5       Delhi  14
6      Mumbai  34

In [11]:
df.loc[[1,2],] #to retrieve all rows

        A         B   C
1   Rohan   Kolkata  34
2  Skillf  Bareilly  24

In [12]:
df.loc[(df["C"]<20)] #to reterive values that is < 20

       A           B   C
3  Shubh  Antarctica  17
4  Aamit     Kolkata  15
5  Ahmed       Delhi  14

In [13]:
# df.loc[(df["A"] < 20) & (df["C"] > 10)]

In [14]:
"""iloc"""
df.iloc[0, 2] #to select by index

92

In [15]:
df.iloc[[0,2], [1,2]]

          B   C
0    Rampur  92
2  Bareilly  24

In [16]:
df

         A           B   C
0    Abdul      Rampur  92
1    Rohan     Kolkata  34
2   Skillf    Bareilly  24
3    Shubh  Antarctica  17
4    Aamit     Kolkata  15
5    Ahmed       Delhi  14
6  Raheman      Mumbai  34

In [17]:
df.drop([1]) #to delete row

         A           B   C
0    Abdul      Rampur  92
2   Skillf    Bareilly  24
3    Shubh  Antarctica  17
4    Aamit     Kolkata  15
5    Ahmed       Delhi  14
6  Raheman      Mumbai  34

In [18]:
df.drop([1, 3]) #to delete multiple columns

         A         B   C
0    Abdul    Rampur  92
2   Skillf  Bareilly  24
4    Aamit   Kolkata  15
5    Ahmed     Delhi  14
6  Raheman    Mumbai  34

In [19]:
df.drop(["A"], axis=1) #to delete column

            B   C
0      Rampur  92
1     Kolkata  34
2    Bareilly  24
3  Antarctica  17
4     Kolkata  15
5       Delhi  14
6      Mumbai  34

In [20]:
df.drop(["A", "C"], axis=1) #to delete multiple columns

            B
0      Rampur
1     Kolkata
2    Bareilly
3  Antarctica
4     Kolkata
5       Delhi
6      Mumbai

In [22]:
df

         A           B   C
0    Abdul      Rampur  92
1    Rohan     Kolkata  34
2   Skillf    Bareilly  24
3    Shubh  Antarctica  17
4    Aamit     Kolkata  15
5    Ahmed       Delhi  14
6  Raheman      Mumbai  34

In [24]:
df.drop(["A", "C"], axis=1, inplace=True) #to change the original data

In [25]:
df

            B
0      Rampur
1     Kolkata
2    Bareilly
3  Antarctica
4     Kolkata
5       Delhi
6      Mumbai